#!/bin/bash
#特殊符号 .*+?^$()[]{}|
#锚字符匹配行首^ 匹配行尾$
#.匹配单个字符
#*匹配0或多个字符
#+匹配1次或多次
#?匹配0或1次
#[]匹配一组字符
#{}:{m,n}匹配m次至n次
#():聚合表达式，将一组字符作为一个字符进行匹配
#|管道，匹配若干个具有或关系的表达式

#匹配数字电话
cat regular.sh | gawk --re-interval '/^\(?[2-9][0-9]{2}\)?(| |-|\.)[0-9]{3}( |-|\.)[0-9]{4}$/{print $0}'

#匹配email
cat regular.sh | gawk --re-interval '/^([a-zA-Z0-9_\-\+]+)@([a-zA-Z0-9_\-]+\.)+([a-zA-Z]{2,5})$/{print $0}'

host@test..test.com
host@.test..test.com
host@test.test.com

(323)456-7890
(323) 456-7890
323-456-7890
323.456.7890
